tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18326_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF18326_H_
#define _PIC16LF18326_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PORTC                         35
#define RC0                           36
#define RC1                           37
#define RC2                           38
#define RC3                           39
#define RC4                           40
#define RC5                           41
#define PIR0                          42
#define INTF                          43
#define IOCIF                         44
#define TMR0IF                        45
#define PIR1                          46
#define TMR1IF                        47
#define TMR2IF                        48
#define BCL1IF                        49
#define SSP1IF                        50
#define TXIF                          51
#define RCIF                          52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define NCO1IF                        56
#define TMR4IF                        57
#define BCL2IF                        58
#define SSP2IF                        59
#define NVMIF                         60
#define C1IF                          61
#define C2IF                          62
#define TMR6IF                        63
#define PIR3                          64
#define CLC1IF                        65
#define CLC2IF                        66
#define CLC3IF                        67
#define CLC4IF                        68
#define TMR3IF                        69
#define TMR3GIF                       70
#define CSWIF                         71
#define OSFIF                         72
#define PIR4                          73
#define CCP1IF                        74
#define CCP2IF                        75
#define CCP3IF                        76
#define CCP4IF                        77
#define TMR5IF                        78
#define TMR5GIF                       79
#define CWG1IF                        80
#define CWG2IF                        81
#define TMR00                         82
#define TMR0L                         83
#define TMR01                         84
#define TMR02                         85
#define TMR03                         86
#define TMR04                         87
#define TMR05                         88
#define TMR06                         89
#define TMR07                         90
#define TMR08                         91
#define TMR0H                         92
#define TMR09                         93
#define TMR010                        94
#define TMR011                        95
#define TMR012                        96
#define TMR013                        97
#define TMR014                        98
#define TMR015                        99
#define T0CON0                        100
#define T0OUTPS                       101
#define T0OUTPS0                      102
#define T0OUTPS1                      103
#define T0OUTPS2                      104
#define T0OUTPS3                      105
#define T016BIT                       106
#define T0OUT                         107
#define T0EN                          108
#define T0CON1                        109
#define T0CKPS                        110
#define T0CKPS0                       111
#define T0CKPS1                       112
#define T0CKPS2                       113
#define T0CKPS3                       114
#define T0ASYNC                       115
#define T0CS                          116
#define T0CS0                         117
#define T0CS1                         118
#define T0CS2                         119
#define TMR1L                         120
#define TMR1H                         121
#define T1CON                         122
#define TMR1ON                        123
#define T1SYNC                        124
#define T1SOSC                        125
#define T1CKPS0                       126
#define T1CKPS                        127
#define T1CKPS1                       128
#define TMR1CS0                       129
#define TMR1CS                        130
#define TMR1CS1                       131
#define T1GCON                        132
#define T1GSS0                        133
#define T1GSS                         134
#define T1GSS1                        135
#define T1GVAL                        136
#define T1GGO_nDONE                   137
#define T1GSPM                        138
#define T1GTM                         139
#define T1GPOL                        140
#define TMR1GE                        141
#define TMR2                          142
#define PR2                           143
#define T2CON                         144
#define T2CKPS0                       145
#define T2CKPS                        146
#define T2CKPS1                       147
#define TMR2ON                        148
#define T2OUTPS0                      149
#define T2OUTPS                       150
#define T2OUTPS1                      151
#define T2OUTPS2                      152
#define T2OUTPS3                      153
#define TRISA                         154
#define TRISA0                        155
#define TRISA1                        156
#define TRISA2                        157
#define TRISA4                        158
#define TRISA5                        159
#define TRISC                         160
#define TRISC0                        161
#define TRISC1                        162
#define TRISC2                        163
#define TRISC3                        164
#define TRISC4                        165
#define TRISC5                        166
#define PIE0                          167
#define INTE                          168
#define IOCIE                         169
#define TMR0IE                        170
#define PIE1                          171
#define TMR1IE                        172
#define TMR2IE                        173
#define BCL1IE                        174
#define SSP1IE                        175
#define TXIE                          176
#define RCIE                          177
#define ADIE                          178
#define TMR1GIE                       179
#define PIE2                          180
#define NCO1IE                        181
#define TMR4IE                        182
#define BCL2IE                        183
#define SSP2IE                        184
#define NVMIE                         185
#define C1IE                          186
#define C2IE                          187
#define TMR6IE                        188
#define PIE3                          189
#define CLC1IE                        190
#define CLC2IE                        191
#define CLC3IE                        192
#define CLC4IE                        193
#define TMR3IE                        194
#define TMR3GIE                       195
#define CSWIE                         196
#define OSFIE                         197
#define PIE4                          198
#define CCP1IE                        199
#define CCP2IE                        200
#define CCP3IE                        201
#define CCP4IE                        202
#define TMR5IE                        203
#define TMR5GIE                       204
#define CWG1IE                        205
#define CWG2IE                        206
#define WDTCON                        207
#define SWDTEN                        208
#define WDTPS                         209
#define WDTPS0                        210
#define WDTPS1                        211
#define WDTPS2                        212
#define WDTPS3                        213
#define WDTPS4                        214
#define ADRESL                        215
#define ADRESH                        216
#define ADCON0                        217
#define ADON                          218
#define GO_nDONE                      219
#define GO                            220
#define ADGO                          221
#define CHS0                          222
#define CHS                           223
#define CHS1                          224
#define CHS2                          225
#define CHS3                          226
#define CHS4                          227
#define CHS5                          228
#define ADCON1                        229
#define ADPREF0                       230
#define ADPREF                        231
#define ADPREF1                       232
#define ADNREF                        233
#define ADCS0                         234
#define ADCS                          235
#define ADCS1                         236
#define ADCS2                         237
#define ADFM                          238
#define ADACT0                        239
#define ADACT                         240
#define ADACT1                        241
#define ADACT2                        242
#define ADACT3                        243
#define ADACT4                        244
#define LATA                          245
#define LATA0                         246
#define LATA1                         247
#define LATA2                         248
#define LATA4                         249
#define LATA5                         250
#define LATC                          251
#define LATC0                         252
#define LATC1                         253
#define LATC2                         254
#define LATC3                         255
#define LATC4                         256
#define LATC5                         257
#define CM1CON0                       258
#define C1SYNC                        259
#define C1HYS                         260
#define C1SP                          261
#define C1POL                         262
#define C1OUT                         263
#define C1ON                          264
#define CM1CON1                       265
#define C1NCH0                        266
#define C1NCH                         267
#define C1NCH1                        268
#define C1NCH2                        269
#define C1PCH                         270
#define C1PCH0                        271
#define C1PCH1                        272
#define C1PCH2                        273
#define C1INTN                        274
#define C1INTP                        275
#define CM2CON0                       276
#define C2SYNC                        277
#define C2HYS                         278
#define C2SP                          279
#define C2POL                         280
#define C2OUT                         281
#define C2ON                          282
#define CM2CON1                       283
#define C2NCH0                        284
#define C2NCH                         285
#define C2NCH1                        286
#define C2NCH2                        287
#define C2PCH                         288
#define C2PCH0                        289
#define C2PCH1                        290
#define C2PCH2                        291
#define C2INTN                        292
#define C2INTP                        293
#define CMOUT                         294
#define MC1OUT                        295
#define MC2OUT                        296
#define BORCON                        297
#define BORRDY                        298
#define SBOREN                        299
#define FVRCON                        300
#define ADFVR0                        301
#define ADFVR                         302
#define ADFVR1                        303
#define CDAFVR                        304
#define CDAFVR0                       305
#define CDAFVR1                       306
#define TSRNG                         307
#define TSEN                          308
#define FVRRDY                        309
#define FVREN                         310
#define DACCON0                       311
#define DAC1NSS                       312
#define DAC1PSS                       313
#define DAC1PSS0                      314
#define DAC1PSS1                      315
#define DAC1OE                        316
#define DAC1EN                        317
#define DACCON1                       318
#define DAC1R                         319
#define DAC1R0                        320
#define DAC1R1                        321
#define DAC1R2                        322
#define DAC1R3                        323
#define DAC1R4                        324
#define ANSELA                        325
#define ANSA0                         326
#define ANSA1                         327
#define ANSA2                         328
#define ANSA4                         329
#define ANSA5                         330
#define ANSELC                        331
#define ANSC0                         332
#define ANSC1                         333
#define ANSC2                         334
#define ANSC3                         335
#define ANSC4                         336
#define ANSC5                         337
#define RC1REG                        338
#define TX1REG                        339
#define SP1BRGL                       340
#define SP1BRGH                       341
#define RC1STA                        342
#define RX9D                          343
#define OERR                          344
#define FERR                          345
#define ADDEN                         346
#define CREN                          347
#define SREN                          348
#define RX9                           349
#define SPEN                          350
#define TX1STA                        351
#define TX9D                          352
#define TRMT                          353
#define BRGH                          354
#define SENDB                         355
#define SYNC                          356
#define TXEN                          357
#define TX9                           358
#define CSRC                          359
#define BAUD1CON                      360
#define ABDEN                         361
#define WUE                           362
#define BRG16                         363
#define SCKP                          364
#define RCIDL                         365
#define ABDOVF                        366
#define WPUA                          367
#define WPUA0                         368
#define WPUA1                         369
#define WPUA2                         370
#define WPUA3                         371
#define WPUA4                         372
#define WPUA5                         373
#define WPUC                          374
#define WPUC0                         375
#define WPUC1                         376
#define WPUC2                         377
#define WPUC3                         378
#define WPUC4                         379
#define WPUC5                         380
#define SSP1BUF_BUF                   381
#define SSP1BUF_BUF0                  382
#define SSP1BUF                       383
#define SSP1BUF0                      384
#define SSP1BUF_BUF1                  385
#define SSP1BUF1                      386
#define SSP1BUF_BUF2                  387
#define SSP1BUF2                      388
#define SSP1BUF_BUF3                  389
#define SSP1BUF3                      390
#define SSP1BUF_BUF4                  391
#define SSP1BUF4                      392
#define SSP1BUF_BUF5                  393
#define SSP1BUF5                      394
#define SSP1BUF_BUF6                  395
#define SSP1BUF6                      396
#define SSP1BUF_BUF7                  397
#define SSP1BUF7                      398
#define SSP1ADD_ADD0                  399
#define SSP1ADD_ADD                   400
#define SSP1ADD0                      401
#define SSP1ADD                       402
#define SSP1ADD_ADD1                  403
#define SSP1ADD1                      404
#define SSP1ADD_ADD2                  405
#define SSP1ADD2                      406
#define SSP1ADD_ADD3                  407
#define SSP1ADD3                      408
#define SSP1ADD_ADD4                  409
#define SSP1ADD4                      410
#define SSP1ADD_ADD5                  411
#define SSP1ADD5                      412
#define SSP1ADD_ADD6                  413
#define SSP1ADD6                      414
#define SSP1ADD_ADD7                  415
#define SSP1ADD7                      416
#define SSP1MSK_MSK0                  417
#define SSP1MSK0                      418
#define SSP1MSK_MSK                   419
#define SSP1MSK                       420
#define SSP1MSK_MSK1                  421
#define SSP1MSK1                      422
#define SSP1MSK_MSK2                  423
#define SSP1MSK2                      424
#define SSP1MSK_MSK3                  425
#define SSP1MSK3                      426
#define SSP1MSK_MSK4                  427
#define SSP1MSK4                      428
#define SSP1MSK_MSK5                  429
#define SSP1MSK5                      430
#define SSP1MSK_MSK6                  431
#define SSP1MSK6                      432
#define SSP1MSK_MSK7                  433
#define SSP1MSK7                      434
#define SSP1STAT                      435
#define SSP1STAT_BF                   436
#define SSP1STAT_UA                   437
#define SSP1STAT_R_nW                 438
#define SSP1STAT_S                    439
#define SSP1STAT_P                    440
#define SSP1STAT_D_nA                 441
#define SSP1STAT_CKE                  442
#define SSP1STAT_SMP                  443
#define SSP1CON1                      444
#define SSP1CON1_SSPM                 445
#define SSP1CON1_SSPM0                446
#define SSP1CON1_SSPM1                447
#define SSP1CON1_SSPM2                448
#define SSP1CON1_SSPM3                449
#define SSP1CON1_CKP                  450
#define SSP1CON1_SSPEN                451
#define SSP1CON1_SSPOV                452
#define SSP1CON1_WCOL                 453
#define SSP1CON2                      454
#define SSP1CON2_SEN                  455
#define SSP1CON2_RSEN                 456
#define SSP1CON2_PEN                  457
#define SSP1CON2_RCEN                 458
#define SSP1CON2_ACKEN                459
#define SSP1CON2_ACKDT                460
#define SSP1CON2_ACKSTAT              461
#define SSP1CON2_GCEN                 462
#define SSP1CON3                      463
#define SSP1CON3_DHEN                 464
#define SSP1CON3_AHEN                 465
#define SSP1CON3_SBCDE                466
#define SSP1CON3_SDAHT                467
#define SSP1CON3_BOEN                 468
#define SSP1CON3_SCIE                 469
#define SSP1CON3_PCIE                 470
#define SSP1CON3_ACKTIM               471
#define SSP2BUF                       472
#define SSP2BUF_BUF0                  473
#define SSP2BUF_BUF                   474
#define SSP2BUF0                      475
#define SSP2BUF_BUF1                  476
#define SSP2BUF1                      477
#define SSP2BUF_BUF2                  478
#define SSP2BUF2                      479
#define SSP2BUF_BUF3                  480
#define SSP2BUF3                      481
#define SSP2BUF_BUF4                  482
#define SSP2BUF4                      483
#define SSP2BUF_BUF5                  484
#define SSP2BUF5                      485
#define SSP2BUF_BUF6                  486
#define SSP2BUF6                      487
#define SSP2BUF_BUF7                  488
#define SSP2BUF7                      489
#define SSP2ADD_ADD0                  490
#define SSP2ADD0                      491
#define SSP2ADD_ADD                   492
#define SSP2ADD                       493
#define SSP2ADD_ADD1                  494
#define SSP2ADD1                      495
#define SSP2ADD_ADD2                  496
#define SSP2ADD2                      497
#define SSP2ADD_ADD3                  498
#define SSP2ADD3                      499
#define SSP2ADD_ADD4                  500
#define SSP2ADD4                      501
#define SSP2ADD_ADD5                  502
#define SSP2ADD5                      503
#define SSP2ADD_ADD6                  504
#define SSP2ADD6                      505
#define SSP2ADD_ADD7                  506
#define SSP2ADD7                      507
#define SSP2MSK_MSK0                  508
#define SSP2MSK                       509
#define SSP2MSK0                      510
#define SSP2MSK_MSK                   511
#define SSP2MSK_MSK1                  512
#define SSP2MSK1                      513
#define SSP2MSK_MSK2                  514
#define SSP2MSK2                      515
#define SSP2MSK_MSK3                  516
#define SSP2MSK3                      517
#define SSP2MSK_MSK4                  518
#define SSP2MSK4                      519
#define SSP2MSK_MSK5                  520
#define SSP2MSK5                      521
